euicc-efs-test/target/test-classes/ES4UpdateSubscriptionAddress.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:add="http://www.w3.org/2005/08/addressing" xmlns:ns="http://namespaces.gsma.org/esim-messaging/3">
   <soap:Header>
      <add:Action>1</add:Action>
      <add:MessageID>2</add:MessageID>
      <add:To>3</add:To>
      <add:From>
         <add:Address>4</add:Address>
         <!--Optional:-->
         <add:ReferenceParameters>
            <!--You may enter ANY elements at this point-->
         </add:ReferenceParameters>
         <!--Optional:-->
         <add:Metadata>
            <!--You may enter ANY elements at this point-->
         </add:Metadata>
         <!--You may enter ANY elements at this point-->
      </add:From>
   </soap:Header>
   <soap:Body>
      <ns:ES4-UpdateSubscriptionAddressRequest>
         <ns:FunctionCallIdentifier>01</ns:FunctionCallIdentifier>
         <!--Optional:-->
         <ns:ValidityPeriod>2</ns:ValidityPeriod>
         <ns:Eid>3839303031303132303132333431323334303132333435363738393031323234</ns:Eid>
         <ns:Iccid>00</ns:Iccid>
         <ns:newSubscriptionAddress>
            <!--Optional:-->
            <ns:Imsi>888</ns:Imsi>
            <!--Optional:-->
            <ns:Msisdn>999</ns:Msisdn>
         </ns:newSubscriptionAddress>
      </ns:ES4-UpdateSubscriptionAddressRequest>
   </soap:Body>
</soap:Envelope>